[
  {
    "id": "storage-node",
    "label": "Storage node",
    "definition": "Entity storing data for Walrus; holds one or several *shards*.",
    "aliases": [
      "storage node (SN)",
      "SN",
      "storage nodes"
    ]
  },
  {
    "id": "blob",
    "label": "Blob",
    "definition": "Single unstructured data object stored on Walrus.",
    "aliases": [
      "blobs"
    ]
  },
  {
    "id": "permanent-blob",
    "label": "Permanent blob",
    "definition": "Blob that cannot be deleted by its owner and is guaranteed to be available until at least its expiry epoch (assuming it is valid)."
  },
  {
    "id": "deletable-blob",
    "label": "Deletable blob",
    "definition": "Blob that can be deleted by its owner at any time to reuse the storage resource."
  },
  {
    "id": "shard",
    "label": "Shard",
    "definition": "(Disjoint) Subset of erasure-encoded data of all blobs; at every point in time, a shard is assigned to and stored on a single storage node."
  },
  {
    "id": "redstuff",
    "label": "RedStuff",
    "definition": "Erasure-encoding approach, which uses two different encodings (primary and secondary) to enable shard recovery; details are available in the [whitepaper](./walrus.pdf)."
  },
  {
    "id": "sliver",
    "label": "Sliver",
    "definition": "Erasure-encoded data of one shard corresponding to a single blob for one of the two encodings; this contains several erasure-encoded symbols of that blob but not the blob metadata."
  },
  {
    "id": "sliver-pair",
    "label": "Sliver pair",
    "definition": "The combination of a shard's primary and secondary sliver."
  },
  {
    "id": "blob-id",
    "label": "Blob ID",
    "definition": "Cryptographic ID computed from a blob's slivers."
  },
  {
    "id": "blob-metadata",
    "label": "Blob metadata",
    "definition": "Metadata of one blob; in particular, this contains a hash per shard to enable the authentication of slivers and recovery symbols."
  },
  {
    "id": "end-user",
    "label": "User",
    "definition": "Any entity or person that wants to store or read blobs on or from Walrus; can act as a Walrus client itself or use the simple interface exposed by publishers and caches.",
    "aliases": [
      "end user"
    ]
  },
  {
    "id": "publisher",
    "label": "Publisher",
    "definition": "Service interacting with Sui and the storage nodes to store blobs on Walrus; offers a basic `HTTP POST` endpoint to end users."
  },
  {
    "id": "aggregator",
    "label": "Aggregator",
    "definition": "Service that reconstructs blobs by interacting with storage nodes and exposes a basic `HTTP GET` endpoint to end users."
  },
  {
    "id": "cache",
    "label": "Cache",
    "definition": "An aggregator with additional caching capabilities."
  },
  {
    "id": "walrus-client",
    "label": "Client",
    "definition": "Entity interacting directly with the storage nodes; this can be an aggregator or cache, a publisher, or an end user.",
    "aliases": [
      "Walrus client"
    ]
  },
  {
    "id": "blob-reconstruction",
    "label": "Reconstruction",
    "definition": "Decoding of the primary slivers to obtain the blob; includes re-encoding the blob and checking the Merkle proofs.",
    "aliases": [
      "blob reconstruction"
    ]
  },
  {
    "id": "shard-sliver-recovery",
    "label": "Shard recovery",
    "definition": "Process of a storage node recovering a sliver or full shard by obtaining recovery symbols from other storage nodes.",
    "aliases": [
      "sliver recovery"
    ]
  },
  {
    "id": "storage-attestation",
    "label": "Storage attestation",
    "definition": "Process where storage nodes exchange challenges and responses to demonstrate that they are storing their currently assigned shards."
  },
  {
    "id": "certificate-of-availability",
    "label": "Certificate of availability",
    "definition": "A blob ID with signatures of storage nodes holding at least \\(2f+1\\) shards in a specific epoch.",
    "aliases": [
      "certificate of availability (CoA)",
      "CoA"
    ]
  },
  {
    "id": "point-of-availability",
    "label": "Point of availability",
    "definition": "Point in time when a certificate of availability is submitted to Sui and the corresponding blob is guaranteed to be available until its expiration.",
    "aliases": [
      "point of availability (PoA)",
      "PoA"
    ]
  },
  {
    "id": "inconsistency-proof",
    "label": "Inconsistency proof",
    "definition": "Set of several recovery symbols with their Merkle proofs such that the decoded sliver does not match the corresponding hash; this proves an incorrect/inconsistent encoding by the client."
  },
  {
    "id": "inconsistency-certificate",
    "label": "Inconsistency certificate",
    "definition": "An aggregated signature from 2/3 of storage nodes (weighted by their number of shards) that they have seen and stored an inconsistency proof for a blob ID."
  },
  {
    "id": "storage-committee",
    "label": "Storage committee",
    "definition": "The set of storage nodes for a storage epoch, including metadata about the shards they are responsible for and other metadata."
  },
  {
    "id": "member",
    "label": "Member",
    "definition": "A storage node that is part of a committee at some epoch."
  },
  {
    "id": "storage-epoch",
    "label": "Storage epoch",
    "definition": "The epoch for Walrus as distinct to the epoch for Sui."
  },
  {
    "id": "availability-period",
    "label": "Availability period",
    "definition": "The period specified in storage epochs for which a blob is certified to be available on Walrus."
  },
  {
    "id": "expiry",
    "label": "Expiry",
    "definition": "The end epoch at which a blob is no longer available and can be deleted; the end epoch is always exclusive."
  },
  {
    "id": "wal",
    "label": "WAL",
    "definition": "The native token of Walrus."
  },
  {
    "id": "frost",
    "label": "FROST",
    "definition": "The smallest unit of WAL (similar to MIST for SUI); 1 WAL is equal to 1 billion (1000000000) FROST."
  }
]
